src/main/resources/soapxml/cell2_true.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Header>
    <Credentials xmlns="http://Airspan.Netspan.WebServices">
      <Username>wsadmin</Username>
      <Password>password</Password>
    </Credentials>
  </S:Header>
  <S:Body>
    <EnbConfigSet xmlns="http://Airspan.Netspan.WebServices">
      <NodeName>Moon_H4K</NodeName>
      <NodeDetail/>
      <EnbDetails>
        <LteCell>
          <CellNumber>2</CellNumber>
          <IsEnabled>true</IsEnabled>
        </LteCell>
      </EnbDetails>
      <EnbSnmpDetail/>
    </EnbConfigSet>
  </S:Body>
</S:Envelope>